backend/app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    if @order.save
---
INSERT INTO "orders" ("user_id", "total_price", "status", "created_at", "updated_at") VALUES (1, 100.0, 'pending', '2024-12-17 16:47:07.314745', '2024-12-17 16:47:07.314745') RETURNING "id"